tutorials/waterToAirShockTube/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limitedGauss    cellLimited Gauss linear 1;
    venkatakrishnan cellLimited<Venkatakrishnan> leastSquares 1;
    grad(U)         Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
   default         Gauss linear corrected;
}

interpolationSchemes
{
    //default        linear;
    reconstruct(p)      blended 0.5 linearUpwind venkatakrishnan upwind;
    reconstruct(alpha)  blended 0.5 linearUpwind venkatakrishnan upwind;
    reconstruct(U.1)    blended 0.5 linearUpwind venkatakrishnan upwind;
    reconstruct(U.2)    blended 0.5 linearUpwind venkatakrishnan upwind;
    reconstruct(T.1)    blended 0.5 linearUpwind venkatakrishnan upwind;
    reconstruct(T.2)    blended 0.5 linearUpwind venkatakrishnan upwind;

    //reconstruct(p)      linearUpwind  venkatakrishnan;
    //reconstruct(alpha)  linearUpwind  venkatakrishnan;
    //reconstruct(U.1)    linearUpwindV venkatakrishnan;
    //reconstruct(U.2)    linearUpwindV venkatakrishnan;
    //reconstruct(T.1)    linearUpwind  venkatakrishnan;
    //reconstruct(T.2)    linearUpwind  venkatakrishnan;

    //reconstruct(p)      MUSCL;
    //reconstruct(alpha)  MUSCL;
    //reconstruct(U.1)    MUSCL;
    //reconstruct(U.2)    MUSCL;
    //reconstruct(T.1)    MUSCL;
    //reconstruct(T.2)    MUSCL;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
}


// ************************************************************************* //
